routes/web.php

*/

Route::get('/', [PostController::class, 'index'])->name('home');
Route::get('posts/{post:slug}', [PostController::class, 'show']);
---
SELECT * FROM `posts` ORDER BY `created_at` DESC


/*Route::get('categories/{category:slug}', function (Category $category){

    return view('posts', [
        'posts' => $category->posts,
        'currentCategory' => $category,
        'categories' => Category::all()
    ]);
})->name('category');

Route::get('authors/{author:username}', function (User $author){
    return view('posts.index', [
        'posts' => $author->posts
    ]);
}); */
---
SELECT * FROM `posts` WHERE `posts`.`category_id` = '2' and `posts`.`category_id` IS not NULL
SELECT * FROM `categories`
SELECT * FROM `posts` WHERE `posts`.`user_id` = '1' and `posts`.`user_id` IS not NULL