app/View/Components/CategoryDropdown.php

	public function render()
	{
		return view('components.category-dropdown', [
			'categories'      => Category::all(),
			'currentCategory' => Category::where('slug', request('category'))->first(),
		]);
---
SELECT * FROM `categories` WHERE `slug` = 'fuga-sapiente-deserunt-omnis-nostrum-repellat-odio' LIMIT 1