app/Http/Controllers/PostController.php

    public function index()
    {
        return view('posts.index', [
            'posts' => Post::latest()->filter(
                request(['search', 'category', 'author'])
            )->paginate(6)->withQuerystring()
        ]);
---
SELECT * FROM `categories` WHERE `categories`.`id` in (2, 54, 55)
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 6 offset 0
SELECT count(*) as aggregate FROM `posts`

    public function store()
    {
      $attributes = request()->validate([
            'title'=> 'required',
            'slug'=> ['required', Rule::unique('posts', 'slug')],
            'excerpt'=> 'required',
            'body'=> 'required',
            'category_id'=> ['required', Rule::exists('categories', 'id')]
        ]);
---
SELECT * FROM `posts` ORDER BY `created_at` DESC