app/Http/Controllers/PostCommentsController.php

INSERT INTO `comments` (`user_id`, `body`, `post_id`, `updated_at`, `created_at`) VALUES ('70', 'Not again!', '42', '2021-10-26 13:06:04', '2021-10-26 13:06:04')
---
    public function store(Post $post)
    {
        request()->validate([
            'body' => 'required'
        ]);


        $post->comments()->create([
            'user_id' => request()->user()->id,
            'body' => request('body')
        ]);