app/Http/Controllers/RegisterController.php

INSERT INTO `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) VALUES ('becky james', 'BeckyJames', 'becky@example.com', 'y$xce7grXPMkvlvk7syBCKh.atZW5WGoqqmKOg8RMsFqIC.IunDtv9K', '2021-10-25 08:46:49', '2021-10-25 08:46:49')
---
    public function store()
    {
        $attributes = request()->validate([
            'name' => 'required|max:255',
            'username' => 'required|min:3|max:255|unique:users,username',
            'email' => 'required|email|max:255|unique:users,email',
            'password' => 'required|max:255|min:7'
        ]);


        $user = User::create($attributes);